<?php
/**
 * Created by PhpStorm.
 * User: ivan
 * Date: 04.06.2018
 * Time: 14:14
 */
define ("host_ddn","es835db.mirohost.net");
define ("user_ddn", "u_fayni");
define ("pass_ddn", "ZID1c0eud3Dc");
define ("db_ddn", "ddnPZS");
class SetClass
{
    private function writeLog($text)
	{
		file_put_contents("cloth_log.txt",$text.PHP_EOL,FILE_APPEND);
	}
	private function translatePos($txt)
    {
        $api_key="trnsl.1.1.20170706T112229Z.752766fa973319f4.6dcbe2932c5e110da20ee3ce61c5986e7e492e7f";
        $lang="ru-uk";
        $txt=str_replace(" ","%20",$txt);
        $link="https://translate.yandex.net/api/v1.5/tr.json/translate?key=".$api_key."&text=".$txt."&lang=".$lang;
        //echo $link."<br>";
        $result=file_get_contents($link);
        $result=json_decode($result,true);
        $ukr_txt=$result['text'][0];
        //var_dump($result);
        return $ukr_txt;
    }
	private function setCloth($id,$name_ukr,$text_ru,$text_ukr)
	{
		$db_connect=mysqli_connect(host_ddn,user_ddn,pass_ddn,db_ddn);
		$query="UPDATE cloth SET cloth_nameua='$name_ukr', cloth_contentru='$text_ru', cloth_contentua='$text_ukr' where cloth_id=$id";
		mysqli_query($db_connect,$query);
		//echo "id=$id $query<br>";
		$this->writeLog($query);
		mysqli_close($db_connect);
	}
    private function getCloth()
    {
        $db_connect=mysqli_connect(host_ddn,user_ddn,pass_ddn,db_ddn);
        $f_id=$this->f_id;
        $query="SELECT cloth_id, clothtype_id, cloth_nameru FROM cloth";
        if ($res=mysqli_query($db_connect,$query))
        {
            while ($row = mysqli_fetch_assoc($res))
            {
                $goods[] = $row;
            }
        }
        else
        {
            echo "Error in SQL ".mysqli_error($db_connect)."<br>";
        }
        mysqli_close($db_connect);
        if (is_array($goods))
        {
            return $goods;
        }
        else
        {
            return null;
        }
    }
    public function setDescr()
    {
        $cloths=$this->getCloth();
        if (is_array($cloths))
        {
            foreach ($cloths as $cloth)
            {
                $id=$cloth['cloth_id'];
                $type=$cloth['clothtype_id'];
				$name_ru=$cloth['cloth_nameru'];
				unset($txt_ru);
				unset($txt_ua);
				$name_ua=$this->translatePos($name_ru);
				if ($type==1)
				{
					$txt_ru="<p><b>Уход:</b> Общая процедура очистки мебели: обработать загрязненный участок небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность. Прогладить негорячим утюгом (температура до 100 °С).<p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалять с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>
<p>Сухой свечной воск следует раздробить, соскрести и собрать пылесосом. Накрыть оставшееся пятно промокательной бумагой и прогладить. Прилипшую жевательную резинку покрыть кубиками льда (в пластиковом пакете) и соскрести тупым предметом. Нанести метиловый спирт на ткань и высушить с прихлопыванием. Пятна от кофе промокнуть влажной тканью, обработать раствором мягкого мыла и высушить избыток влаги. Высохшие пятна от шоколада счистить и обработать раствором мягкого мыла. Высушить избыток влаги.</p>
<p>Важно! Запрещается отжимать и сушить съемный чехол дивана, кресла или банкетки в стиральной машине.</p>";
					$txt_ua="<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню. Пропрасувати негарячою праскою (температура до 100 °С).</p>
<p>Не відскоблювати засохлі плями або ворс матеріалу, який злипся! Плями можна видаляти за допомогою поролонової губки з мильною піною, протирати після сухою серветкою.</p>
<p>Сухий віск свічки слід роздрібнити, зішкрябати і зібрати пилососом. Накрити пляму промокальним папером і пропрасувати. Прилиплу жувальну гумку покрити кубиками льоду (в пластиковому пакеті) і зішкрябати тупим предметом. Нанести метиловий спирт на тканину і висушити з прихлопуванням. Плями від кави промокнути вологою тканиною, обробити розчином м\'якого мила і висушити надлишок вологи. Висохлі плями від шоколаду зчистити і обробити розчином м\'якого мила. Висушити надлишок вологи.</p>
<p>Важливо! Забороняється віджимати і сушити знімний чохол дивана, крісла або банкетки в пральній машині.</p>";
				}
				if ($type==2)
				{
					$txt_ru="<pСостав: 30 % ХЛ, 70 % ПЭС</p><p>Плотность (г/м кв.): 180</p><p>Ширина (см): 142</p><p>Износостойкость по тесту Martindale (циклов): 20 000</p>
<p>Уход: Общая процедура очистки мебели: обработать загрязненный участок небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность. Прогладить негорячим утюгом (температура до 100 °С).<p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалять с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>
<p>Сухой свечной воск следует раздробить, соскрести и собрать пылесосом. Накрыть оставшееся пятно промокательной бумагой и прогладить. Прилипшую жевательную резинку покрыть кубиками льда (в пластиковом пакете) и соскрести тупым предметом. Нанести метиловый спирт на ткань и высушить с прихлопыванием. Пятна от кофе промокнуть влажной тканью, обработать раствором мягкого мыла и высушить избыток влаги. Высохшие пятна от шоколада счистить и обработать раствором мягкого мыла. Высушить избыток влаги.</p>
<p>Важно! Запрещается отжимать и сушить съемный чехол дивана, кресла или банкетки в стиральной машине.</p>";
					$txt_ua="<p>Склад: 30% ХЛ, 70% ПОС</p><p>Щільність (г / м кв.): 180</p><p>Ширина (см): 142</p><p>Зносостійкість по тесту Martindale (циклів): 20 000</p>
<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню. Пропрасувати негарячою праскою (температура до 100 °С).</p>
<p>Не відскоблювати засохлі плями або ворс матеріалу, який злипся! Плями можна видаляти за допомогою поролонової губки з мильною піною, протирати після сухою серветкою.</p>
<p>Сухий віск свічки слід роздрібнити, зішкрябати і зібрати пилососом. Накрити пляму промокальним папером і пропрасувати. Прилиплу жувальну гумку покрити кубиками льоду (в пластиковому пакеті) і зішкрябати тупим предметом. Нанести метиловий спирт на тканину і висушити з прихлопуванням. Плями від кави промокнути вологою тканиною, обробити розчином м\'якого мила і висушити надлишок вологи. Висохлі плями від шоколаду зчистити і обробити розчином м\'якого мила. Висушити надлишок вологи.</p>
<p>Важливо! Забороняється віджимати і сушити знімний чохол дивана, крісла або банкетки в пральній машині.</p>";
				}
				if ($type==10)
				{
					$txt_ru="<p>Уход: Общая процедура очистки мебели: обработать загрязненный участок мебели небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность; прогладить утюгом с отпаривателем (температура до 50 °С). Гладить следует с изнаночной стороны. Сильное загрязнение ликвидировать с помощью чистящих средств на водной основе.<p>
<p>Пятна удалять с помощью поролоновой губки с мыльной пеной и обработкой сухой салфеткой. Для удаления пятен от шариковой ручки или помады обработать участок обивки дивана, кресла или банкетки с помощью 10-процентного спиртового раствора и смыть теплой водой. Жирные и мокрые пятна легко удалить, если приложить к ним хорошо впитывающее полотенце.</p>
<p>Важно! Не пользуйтесь чистящими средствами, содержащими сильные химикаты, и растворителями на основе нефтепродуктов. Нельзя выжимать, отбеливать. Химическая чистка запрещена.</p>";
					$txt_ua="<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку меблів невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню; пропрасувати праскою з відпарювачем (температура до 50 °С). Прасувати слід з виворітного боку. Сильне забруднення ліквідувати за допомогою чистячих засобів на водній основі.</p>
<p>Плями видаляти за допомогою поролонової губки з мильною піною і обробки сухою серветкою. Для видалення плям від кулькової ручки або помади обробити ділянку оббивки дивана, крісла або банкетки за допомогою 10-відсоткового спиртового розчину і змити теплою водою. Жирні і мокрі плями легко видалити, якщо прикласти до них рушник, який добре вбирає вологу.</p>
<p>Важливо! Не використовуйте засоби для чищення, що містять сильні хімікати, і розчинники на основі нафтопродуктів. Не можна віджимати, відбілювати. Хімічна чистка заборонена.</p>";
				}
				if ($type==4)
				{
					$txt_ru="<p>Уход: Общая процедура очистки мебели: обработать загрязненный участок небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность. Прогладить негорячим утюгом (температура до 100 °С).<p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалять с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>
<p>Сухой свечной воск следует раздробить, соскрести и собрать пылесосом. Накрыть оставшееся пятно промокательной бумагой и прогладить. Прилипшую жевательную резинку покрыть кубиками льда (в пластиковом пакете) и соскрести тупым предметом. Нанести метиловый спирт на ткань и высушить с прихлопыванием. Пятна от кофе промокнуть влажной тканью, обработать раствором мягкого мыла и высушить избыток влаги. Высохшие пятна от шоколада счистить и обработать раствором мягкого мыла. Высушить избыток влаги.</p>
<p>Важно! Запрещается отжимать и сушить съемный чехол дивана, кресла или банкетки в стиральной машине.</p>";
					$txt_ua="<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню. Пропрасувати негарячою праскою (температура до 100 °С).</p>
<p>Не відскоблювати засохлі плями або ворс матеріалу, який злипся! Плями можна видаляти за допомогою поролонової губки з мильною піною, протирати після сухою серветкою.</p>
<p>Сухий віск свічки слід роздрібнити, зішкрябати і зібрати пилососом. Накрити пляму промокальним папером і пропрасувати. Прилиплу жувальну гумку покрити кубиками льоду (в пластиковому пакеті) і зішкрябати тупим предметом. Нанести метиловий спирт на тканину і висушити з прихлопуванням. Плями від кави промокнути вологою тканиною, обробити розчином м\'якого мила і висушити надлишок вологи. Висохлі плями від шоколаду зчистити і обробити розчином м\'якого мила. Висушити надлишок вологи.</p>
<p>Важливо! Забороняється віджимати і сушити знімний чохол дивана, крісла або банкетки в пральній машині.</p>";
				}
				if ($type==15)
				{
					$txt_ru="<p>Состав: 100 % ПЭС</p><p>Плотность (г/м кв.): 265</p><p>Ширина (см): 142</p><p>Износостойкость по тесту Martindale (циклов): 10 000</p>
<p><b>Уход:</b> Общая процедура очистки мебели: обработать загрязненный участок небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность. Прогладить негорячим утюгом (температура до 100 °С).<p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалять с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>
<p>Сухой свечной воск следует раздробить, соскрести и собрать пылесосом. Накрыть оставшееся пятно промокательной бумагой и прогладить. Прилипшую жевательную резинку покрыть кубиками льда (в пластиковом пакете) и соскрести тупым предметом. Нанести метиловый спирт на ткань и высушить с прихлопыванием. Пятна от кофе промокнуть влажной тканью, обработать раствором мягкого мыла и высушить избыток влаги. Высохшие пятна от шоколада счистить и обработать раствором мягкого мыла. Высушить избыток влаги.</p>
<p>Важно! Запрещается отжимать и сушить съемный чехол дивана, кресла или банкетки в стиральной машине.</p>";
					$txt_ua="<p>Склад: 100% ПОС</p><p>Щільність (г / м кв.): 265</p><p>Ширина (см): 142</p><p>Зносостійкість по тесту Martindale (циклів): 10 000</p>
<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню. Пропрасувати негарячою праскою (температура до 100 °С).</p>
<p>Не відскоблювати засохлі плями або ворс матеріалу, який злипся! Плями можна видаляти за допомогою поролонової губки з мильною піною, протирати після сухою серветкою.</p>
<p>Сухий віск свічки слід роздрібнити, зішкрябати і зібрати пилососом. Накрити пляму промокальним папером і пропрасувати. Прилиплу жувальну гумку покрити кубиками льоду (в пластиковому пакеті) і зішкрябати тупим предметом. Нанести метиловий спирт на тканину і висушити з прихлопуванням. Плями від кави промокнути вологою тканиною, обробити розчином м\'якого мила і висушити надлишок вологи. Висохлі плями від шоколаду зчистити і обробити розчином м\'якого мила. Висушити надлишок вологи.</p>
<p>Важливо! Забороняється віджимати і сушити знімний чохол дивана, крісла або банкетки в пральній машині.</p>";
				}
				if ($type==5)
				{
					$txt_ru="<p>Общая процедура очистки мебели: обработать загрязненный участок мебели небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность; прогладить утюгом с отпаривателем (температура до 50 °С). Гладить следует с изнаночной стороны. Сильное загрязнение ликвидировать с помощью чистящих средств на водной основе.<p>
<p>Пятна удалять с помощью поролоновой губки с мыльной пеной и обработкой сухой салфеткой. Для удаления пятен от шариковой ручки или помады обработать участок обивки дивана, кресла или банкетки с помощью 10-процентного спиртового раствора и смыть теплой водой. Жирные и мокрые пятна легко удалить, если приложить к ним хорошо впитывающее полотенце.</p>
<p>Важно! Не пользуйтесь чистящими средствами, содержащими сильные химикаты, и растворителями на основе нефтепродуктов. Нельзя выжимать, отбеливать. Химическая чистка запрещена.</p>";
					$txt_ua="<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку меблів невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню; пропрасувати праскою з відпарювачем (температура до 50 °С). Прасувати слід з виворітного боку. Сильне забруднення ліквідувати за допомогою чистячих засобів на водній основі.</p>
<p>Плями видаляти за допомогою поролонової губки з мильною піною і обробки сухою серветкою. Для видалення плям від кулькової ручки або помади обробити ділянку оббивки дивана, крісла або банкетки за допомогою 10-відсоткового спиртового розчину і змити теплою водою. Жирні і мокрі плями легко видалити, якщо прикласти до них рушник, що добре вбирає вологу.</p>
<p>Важливо! Не використовуйте засоби для чищення, що містять сильні хімікати, і розчинники на основі нафтопродуктів. Не можна викручувати від води, вибілювати. Хімічна чистка заборонена.</p>";
				}
				if ($type==6)
				{
					$txt_ru="<p>Общая процедура очистки мебели: пятна удалять с помощью поролоновой губки с мыльной пеной и обработкой сухой салфеткой. для удаления пятен от шариковой ручки или помады обработать участок обивки дивана, кресла или банкетки с помощью 10-процентного спиртового раствора и смыть теплой водой. Жирные и мокрые пятна легко удалить, если приложить к ним хорошо впитывающее полотенце.<p>
<p>Для удаления свежих жирных пятен обработайте загрязненный участок мягкой мебели небольшим количеством воды и мягкого мыла, подождите 2-3 минуты и сотрите пятно круговыми движениями губки или мягкой щетки. Высушив ворс, Вы легко восстановите его, расчесав в существующем направлении. Пятна, нанесенные шариковой ручкой или помадой, можно нейтрализовать с помощью 10 % спиртового раствора и смыть теплой водой.</p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалить с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>";
					$txt_ua="<p>Догляд: Загальна процедура очищення меблів: плями видаляти за допомогою поролонової губки з мильною піною і обробки сухою серветкою. Для видалення плям від кулькової ручки або помади обробити ділянку оббивки дивана, крісла або банкетки за допомогою 10-відсоткового спиртового розчину і змити теплою водою. Жирні і мокрі плями легко видалити, якщо прикласти до них рушник, що добре вбирає вологу.</p>
<p>Для видалення свіжих жирних плям обробіть забруднену ділянку м'яких меблів невеликою кількістю води і м\'якого мила, почекайте 2-3 хвилини і зітріть пляму круговими рухами губки або м\'якої щітки. Висушивши ворс, Ви легко відновите його, розчесавши в існуючому напрямку.</p>
<p>Не відколювати засохлі плями або зліплений ворс матеріалу! Плями можна видалити за допомогою поролонової губки з мильною піною.</p>";
				}
				if ($type==12)
				{
					$txt_ru="<p>Состав: 100 % ХЛ</p><p>Плотность (г/м кв.): 210</p><p>Ширина (см): 180</p><p>Износостойкость по тесту Martindale (циклов): 10 000</p>
<p><b>Уход:</b> Общая процедура очистки мебели: обработать загрязненный участок небольшим количеством воды (до 40 °С) и мягкого мыла; через 2-3 минуты стереть пятно губкой; высушить поверхность. Прогладить негорячим утюгом (температура до 100 °С).<p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалять с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>
<p>Сухой свечной воск следует раздробить, соскрести и собрать пылесосом. Накрыть оставшееся пятно промокательной бумагой и прогладить. Прилипшую жевательную резинку покрыть кубиками льда (в пластиковом пакете) и соскрести тупым предметом. Нанести метиловый спирт на ткань и высушить с прихлопыванием. Пятна от кофе промокнуть влажной тканью, обработать раствором мягкого мыла и высушить избыток влаги. Высохшие пятна от шоколада счистить и обработать раствором мягкого мыла. Высушить избыток влаги.</p>
<p>Важно! Запрещается отжимать и сушить съемный чехол дивана, кресла или банкетки в стиральной машине.</p>";
					$txt_ua="<p>Склад: 100% ХЛ</p><p>Щільність (г / м кв.): 210</p><p>Ширина (см): 180</p><p>Зносостійкість по тесту Martindale (циклів): 10 000</p>
<p>Догляд: Загальна процедура очищення меблів: обробити забруднену ділянку невеликою кількістю води (до 40 °С) і м\'якого мила; через 2-3 хвилини стерти пляму губкою; висушити поверхню. Пропрасувати негарячою праскою (температура до 100 °С).</p>
<p>Не відскоблювати засохлі плями або ворс матеріалу, який злипся! Плями можна видаляти за допомогою поролонової губки з мильною піною, протирати після сухою серветкою.</p>
<p>Сухий віск свічки слід роздрібнити, зішкрябати і зібрати пилососом. Накрити пляму промокальним папером і пропрасувати. Прилиплу жувальну гумку покрити кубиками льоду (в пластиковому пакеті) і зішкрябати тупим предметом. Нанести метиловий спирт на тканину і висушити з прихлопуванням. Плями від кави промокнути вологою тканиною, обробити розчином м\'якого мила і висушити надлишок вологи. Висохлі плями від шоколаду зчистити і обробити розчином м\'якого мила. Висушити надлишок вологи.</p>
<p>Важливо! Забороняється віджимати і сушити знімний чохол дивана, крісла або банкетки в пральній машині.</p>";
				}
				if ($type==9)
				{
					$txt_ru="<p>Состав: лицо: 100 % НЕ. Основа: 65 % ПЭС, 35 % ХЛ</p><p>Плотность (г/м кв.): 260</p><p>Ширина (см): 145</p><p>Износостойкость по тесту Martindale (циклов): 10 000</p>
<p><b>Уход:</b> Общая процедура очистки мебели: пятна удалять с помощью поролоновой губки с мыльной пеной и обработкой сухой салфеткой. для удаления пятен от шариковой ручки или помады обработать участок обивки дивана, кресла или банкетки с помощью 10-процентного спиртового раствора и смыть теплой водой. Жирные и мокрые пятна легко удалить, если приложить к ним хорошо впитывающее полотенце.<p>
<p>Для удаления свежих жирных пятен обработайте загрязненный участок мягкой мебели небольшим количеством воды и мягкого мыла, подождите 2-3 минуты и сотрите пятно круговыми движениями губки или мягкой щетки. Высушив ворс, Вы легко восстановите его, расчесав в существующем направлении. Пятна, нанесенные шариковой ручкой или помадой, можно нейтрализовать с помощью 10 % спиртового раствора и смыть теплой водой.</p>
<p>Не отскабливайте засохшие пятна или слипшийся ворс материала! Пятна можно удалить с помощью поролоновой губки с мыльной пеной, промокнув сухой салфеткой.</p>";
					$txt_ua="<p>Склад: 100% НЕ Основа: 65 % ПЕС, 35 % ХЛ</p><p>Щільність (г / м кв.): 180</p><p>Ширина (см): 145</p><p>Зносостійкість по тесту Martindale (циклів): 10 000</p>
<p>Догляд: Загальна процедура очищення меблів: плями видаляти за допомогою поролонової губки з мильною піною і обробки сухою серветкою. Для видалення плям від кулькової ручки або помади обробити ділянку оббивки дивана, крісла або банкетки за допомогою 10-відсоткового спиртового розчину і змити теплою водою. Жирні і мокрі плями легко видалити, якщо прикласти до них рушник, що добре вбирає вологу.</p>
<p>Для видалення свіжих жирних плям обробіть забруднену ділянку м'яких меблів невеликою кількістю води і м\'якого мила, почекайте 2-3 хвилини і зітріть пляму круговими рухами губки або м\'якої щітки. Висушивши ворс, Ви легко відновите його, розчесавши в існуючому напрямку.</p>
<p>Не відколювати засохлі плями або зліплений ворс матеріалу! Плями можна видалити за допомогою поролонової губки з мильною піною.</p>";
				}
				$this->setCloth($id, $name_ua, $txt_ru, $txt_ua);
            }
        }
        else
        {
            echo "No array of Cloth<br>";
        }
    }
}

$test = new SetClass();
$test->setDescr();
